# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [2]:
#Your code here; import the necessary packages
import sqlite3
import pandas as pd
conn=sqlite3.connect("data.sqlite")
cursor=conn.cursor()

In [3]:
#Your code here; create the connection and cursor

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [4]:
#Your code here; use a subquery. No join will be necessary.
query1='''select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       where customernumber in (select customernumber from orders
       where orderDate = '2003-01-31')'''
pd.read_sql_query(query1,conn)

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [14]:
#Your code here
query2= '''select productcode, productname, order_sum from products
join (select productcode, sum(quantityordered) as order_sum
from orderdetails group by productcode) using(productcode)
order by order_sum asc'''
pd.read_sql_query(query2,conn)

    productCode                              productName  order_sum
0      S18_4933                    1957 Ford Thunderbird        767
1      S24_1046               1970 Chevy Chevelle SS 454        803
2      S24_3969         1936 Mercedes Benz 500k Roadster        824
3      S18_2248                       1911 Ford Town Car        832
4      S18_2870             1999 Indy 500 Monte Carlo SS        855
5      S18_4409      1932 Alfa Romeo 8C2300 Spider Sport        866
6      S24_4048        1992 Porsche Cayenne Turbo Silver        867
7      S24_3191                1969 Chevrolet Camaro Z28        870
8      S24_2887                        1952 Citroen-15CV        873
9      S18_2795                   1928 Mercedes-Benz SSK        880
10     S18_3140                        1903 Ford Model A        883
11     S24_3420                1937 Horch 930V Limousine        884
12     S24_3432                      2002 Chevy Corvette        894
13    S700_1691              American Airlines: B767-300        894
14    S700_3962                           The Queen Mary        896
15    S700_2047                               HMS Bounty        897
16     S32_4485                1974 Ducati 350 Mk3 Desmo        898
17    S700_1938                            The Mayflower        898
18     S12_3990                  1970 Plymouth Hemi Cuda        900
19     S32_2206                        1982 Ducati 996 R        906
20     S18_3136      18th Century Vintage Horse Carriage        907
21     S32_1268              1980â€™s GM Manhattan Express        911
22     S24_2972                  1982 Lamborghini Diablo        912
23     S18_1589                    1965 Aston Martin DB5        914
24     S18_3482                    1976 Ford Gran Torino        915
25     S24_1628                1966 Shelby Cobra 427 S/C        915
26     S18_1984                         1995 Honda Civic        917
27     S18_2581                           P-51-D Mustang        917
28     S18_1749                 1917 Grand Touring Sedan        918
29     S18_3259                 Collectable Wooden Train        918
..          ...                                      ...        ...
79     S18_4668                  1939 Cadillac Limousine        995
80    S700_2824                          1982 Camaro Z28        997
81     S18_2432                    1926 Ford Fire Engine        998
82     S10_2016                    1996 Moto Guzzi 1100i        999
83     S18_1097                   1940 Ford Pickup Truck        999
84     S24_4278                  1900s Vintage Tri-Plane       1009
85     S24_2011                    18th century schooner       1011
86     S18_4721                1957 Corvette Convertible       1013
87     S32_1374                         1997 BMW F650 ST       1014
88     S24_2000                 1960 BSA Gold Star DBD34       1015
89     S12_1108                        2001 Ferrari Enzo       1019
90    S700_2610                The USS Constitution Ship       1020
91     S12_2823                         2002 Suzuki XREO       1028
92     S24_2300                 1962 Volkswagen Microbus       1029
93     S10_4757                      1972 Alfa Romeo GTA       1030
94     S24_1578                        1997 BMW R 1100 S       1033
95     S18_2949              1913 Ford Model T Speedster       1038
96     S18_1662              1980s Black Hawk Helicopter       1040
97    S700_3167                       F/A 18 Hornet 1/72       1047
98     S24_3949                 Corsair F4U ( Bird Cage)       1051
99     S24_3856                  1956 Porsche 356A Coupe       1052
100    S18_2319                   1964 Mercedes Tour Bus       1053
101    S12_4473                        1957 Chevy Pickup       1056
102    S10_1678    1969 Harley Davidson Ultimate Chopper       1057
103    S18_4600                         1940s Ford truck       1061
104    S50_1341             1930 Buick Marquette Phaeton       1074
105    S18_3856  1941 Chevrolet Special Deluxe Cabriolet       1076
106   S700_4002                American Airlines: MD-11S       1085
107    S18_1342                     1937 Lincoln Berline       1111
108    S18_3232              1992 Ferrari 360 Spider red       1808

[109 rows x 3 columns]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [15]:
#Your code here
query3= '''select productcode, productname from products
where productcode in (select productcode, ordernumber from orderdetails 
where ordernumber in (select ordernumber from orders)) '''
pd.read_sql_query(query3,conn)

DatabaseError: Execution failed on sql 'select productcode, productname from products
where productcode in (select productcode, ordernumber from orderdetails
where ordernumber in (select ordernumber from orders)) ': sub-select returns 2 columns - expected 1

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
#Your code here

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!